---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceLoadContext.Dispose
source: html/cafea77e-c323-78a7-a8ae-9d1bc1fbb943.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadContext.Dispose Method

Releases all resources used by the ExternalResourceLoadContext

## Syntax (C#)
```csharp
public void Dispose()
```